RT-Thread/rt-thread/bsp/Infineon/psoc6-cy8ckit-062S2-43012/libs/TARGET_CY8CKIT-062S2-43012/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_LINEARSLIDER0_STATUS_VALUE                                   (cy_capsense_tuner.widgetContext[2].status)
#define CY_CAPSENSE_LINEARSLIDER0_STATUS_OFFSET                                  (175u)
#define CY_CAPSENSE_LINEARSLIDER0_STATUS_SIZE                                    (1u)
#define CY_CAPSENSE_LINEARSLIDER0_STATUS_PARAM_ID                                (0x010200afu)

#define CY_CAPSENSE_LINEARSLIDER0_PTRPOSITION_VALUE                              (cy_capsense_tuner.widgetContext[2].wdTouch.ptrPosition)
#define CY_CAPSENSE_LINEARSLIDER0_PTRPOSITION_OFFSET                             (176u)
#define CY_CAPSENSE_LINEARSLIDER0_PTRPOSITION_SIZE                               (4u)
#define CY_CAPSENSE_LINEARSLIDER0_PTRPOSITION_PARAM_ID                           (0x030200b0u)

#define CY_CAPSENSE_LINEARSLIDER0_NUM_POSITIONS_VALUE                            (cy_capsense_tuner.widgetContext[2].wdTouch.numPosition)
#define CY_CAPSENSE_LINEARSLIDER0_NUM_POSITIONS_OFFSET                           (180u)
#define CY_CAPSENSE_LINEARSLIDER0_NUM_POSITIONS_SIZE                             (1u)
#define CY_CAPSENSE_LINEARSLIDER0_NUM_POSITIONS_PARAM_ID                         (0x010200b4u)

#define CY_CAPSENSE_BUTTON0_RX0_RAW0_VALUE                                       (cy_capsense_tuner.sensorContext[0].raw)
#define CY_CAPSENSE_BUTTON0_RX0_RAW0_OFFSET                                      (184u)
#define CY_CAPSENSE_BUTTON0_RX0_RAW0_SIZE                                        (2u)
#define CY_CAPSENSE_BUTTON0_RX0_RAW0_PARAM_ID                                    (0x020000b8u)

#define CY_CAPSENSE_BUTTON0_RX0_BSLN0_VALUE                                      (cy_capsense_tuner.sensorContext[0].bsln)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN0_OFFSET                                     (186u)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN0_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN0_PARAM_ID                                   (0x020000bau)

#define CY_CAPSENSE_BUTTON0_RX0_DIFF0_VALUE                                      (cy_capsense_tuner.sensorContext[0].diff)
#define CY_CAPSENSE_BUTTON0_RX0_DIFF0_OFFSET                                     (188u)
#define CY_CAPSENSE_BUTTON0_RX0_DIFF0_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON0_RX0_DIFF0_PARAM_ID                                   (0x020000bcu)

#define CY_CAPSENSE_BUTTON0_RX0_STATUS0_VALUE                                    (cy_capsense_tuner.sensorContext[0].status)
#define CY_CAPSENSE_BUTTON0_RX0_STATUS0_OFFSET                                   (190u)
#define CY_CAPSENSE_BUTTON0_RX0_STATUS0_SIZE                                     (1u)
#define CY_CAPSENSE_BUTTON0_RX0_STATUS0_PARAM_ID                                 (0x010000beu)

#define CY_CAPSENSE_BUTTON0_RX0_NEG_BSLN_RST_CNT0_VALUE                          (cy_capsense_tuner.sensorContext[0].negBslnRstCnt)
#define CY_CAPSENSE_BUTTON0_RX0_NEG_BSLN_RST_CNT0_OFFSET                         (191u)
#define CY_CAPSENSE_BUTTON0_RX0_NEG_BSLN_RST_CNT0_SIZE                           (1u)
#define CY_CAPSENSE_BUTTON0_RX0_NEG_BSLN_RST_CNT0_PARAM_ID                       (0x010000bfu)

#define CY_CAPSENSE_BUTTON0_RX0_IDAC0_VALUE                                      (cy_capsense_tuner.sensorContext[0].idacComp)
#define CY_CAPSENSE_BUTTON0_RX0_IDAC0_OFFSET                                     (192u)
#define CY_CAPSENSE_BUTTON0_RX0_IDAC0_SIZE                                       (1u)
#define CY_CAPSENSE_BUTTON0_RX0_IDAC0_PARAM_ID                                   (0x010000c0u)

#define CY_CAPSENSE_BUTTON0_RX0_BSLN_EXT0_VALUE                                  (cy_capsense_tuner.sensorContext[0].bslnExt)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN_EXT0_OFFSET                                 (193u)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN_EXT0_SIZE                                   (1u)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN_EXT0_PARAM_ID                               (0x010000c1u)

#define CY_CAPSENSE_BUTTON1_RX0_RAW0_VALUE                                       (cy_capsense_tuner.sensorContext[1].raw)
#define CY_CAPSENSE_BUTTON1_RX0_RAW0_OFFSET                                      (194u)
#define CY_CAPSENSE_BUTTON1_RX0_RAW0_SIZE                                        (2u)
#define CY_CAPSENSE_BUTTON1_RX0_RAW0_PARAM_ID                                    (0x020100c2u)

#define CY_CAPSENSE_BUTTON1_RX0_BSLN0_VALUE                                      (cy_capsense_tuner.sensorContext[1].bsln)
#define CY_CAPSENSE_BUTTON1_RX0_BSLN0_OFFSET                                     (196u)
#define CY_CAPSENSE_BUTTON1_RX0_BSLN0_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON1_RX0_BSLN0_PARAM_ID                                   (0x020100c4u)

#define CY_CAPSENSE_BUTTON1_RX0_DIFF0_VALUE                                      (cy_capsense_tuner.sensorContext[1].diff)
#define CY_CAPSENSE_BUTTON1_RX0_DIFF0_OFFSET                                     (198u)
#define CY_CAPSENSE_BUTTON1_RX0_DIFF0_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON1_RX0_DIFF0_PARAM_ID                                   (0x020100c6u)

#define CY_CAPSENSE_BUTTON1_RX0_STATUS0_VALUE                                    (cy_capsense_tuner.sensorContext[1].status)
#define CY_CAPSENSE_BUTTON1_RX0_STATUS0_OFFSET                                   (200u)
#define CY_CAPSENSE_BUTTON1_RX0_STATUS0_SIZE                                     (1u)
#define CY_CAPSENSE_BUTTON1_RX0_STATUS0_PARAM_ID                                 (0x010100c8u)

#define CY_CAPSENSE_BUTTON1_RX0_NEG_BSLN_RST_CNT0_VALUE                          (cy_capsense_tuner.sensorContext[1].negBslnRstCnt)
#define CY_CAPSENSE_BUTTON1_RX0_NEG_BSLN_RST_CNT0_OFFSET                         (201u)
#define CY_CAPSENSE_BUTTON1_RX0_NEG_BSLN_RST_CNT0_SIZE                           (1u)
#define CY_CAPSENSE_BUTTON1_RX0_NEG_BSLN_RST_CNT0_PARAM_ID                       (0x010100c9u)

#define CY_CAPSENSE_BUTTON1_RX0_IDAC0_VALUE                                      (cy_capsense_tuner.sensorContext[1].idacComp)
#define CY_CAPSENSE_BUTTON1_RX0_IDAC0_OFFSET                                     (202u)
#define CY_CAPSENSE_BUTTON1_RX0_IDAC0_SIZE                                       (1u)
#define CY_CAPSENSE_BUTTON1_RX0_IDAC0_PARAM_ID                                   (0x010100cau)

